art/note/chapter02.org
#+TITLE: ISA and Assembly
* chapter 2
** ISA 是什么? 

risc-v 是一种指令集架构: ISA (instruction set architecture). 也称为处理器架构

使用同一个指令集架构的计算机就是这种 ISA 的系列机, 比如说 risc-v 系列机, Arm 系列机.  

一个 ISA 有很多参数, 最基本的参数就是通用寄存器的位宽, 一般有32bit和64 bit之分. 位宽, 指定了通用寄存器的宽度. 其决定了决定了寻址范围的大小, 数据运算能力的强弱. 地址长度为寄存器的长度, 64 bit 的地址范围当然是比 32 bit 的要长的多. 

其需要和指令编码长度分开, 指令的编码长度是越小越好的. 因为这样效率更高.

*** 原则

1. 简单性来自于规则性
2. 越小越快
3. 加速经常性时间.  经常使用的指令尽量短. 
4. 需要良好的折衷.


*** TODO 汇编语言的优缺点 

废话吧这是

** risc-v ISA

*** 指令格式

For example, 汇编指令的格式为 
    
#+begin_example
op dst src1 src2
#+end_example

这是最一般的指令格式, 其中有 dst(destination), 两个来源 src. 一个指令
对应一个操作. 一行最多一条指令. C语言之中的操作会被分解为一条或者是多
条指令. 来源可以是 imm 也可以是寄存器的值. 

And for example, we have 
#+begin_example
add x1 x2 x3
#+end_example
that is to say we add the values of ~x2~ and ~x3~, and the sum goes to ~x1~

*** 寄存器

32个通用寄存器, ~x0--x31~. 注意这里仅仅涉及 RV32I 或者是 RV64I 的寄存器, 这两个是 risc-v 指令的子集, 其他子集会用到其他的寄存器. 这算 dark side. For float point manipulation, we employ some processor that does the job, that is there is chip that is for float point manipulation, and there are corresponding register and instructions.

算术逻辑运算所操作的数据必须直接来自于寄存器[fn:1]. 涉及内存的操作只有 load 指令和 save 指令. 其中 ~x0~ 是一个特殊的寄存器, 其值恒为 0. RV32I 指令集通用寄存器的长度为 32 位, 而RV64I指令集对应的长度是 64 位

汇编是相对原始的[fn:2], 汇编语言之中没有变量的概念. 直接使用寄存器操作. 直接
使用寄存器能够最大化速度. 缺点在于寄存器的数量非常有限, 需要好好规划. 

|---------+--------+-----------------------------|
| 寄存器  | 符号   | 说明                        |
|---------+--------+-----------------------------|
| ~x0~    | zero   | 值为0                       |
| ~x1~    | ra     | return address              |
| ~x2~    | sp     | stack pointer               |
| ~x3~    | gp     | global pointer              |
| ~x4~    | tp     | thread pointer              |
| ~x5-x7~ | t0-t2  | temporary register          |
| ~x8~    | s0/fp  | save register/frame pointer |
| ~x9~    | s1     | save register               |
| ~x10-x11~ | a0-a1  | return value                |
| ~x12-x17~ | a2-a7  | function argument           |
| ~x18-x27~ | s2-s11 | save register               |
| ~x28-x31~ | t3-t6  | temporary register          |
|---------+--------+-----------------------------|

[fn:2] Knuth may also think that the assembly is a little annoying, but he employed assembly to express algorithm in his book. Cool!

*** 内存

Save Load instructions 实现寄存器和内存之间的读写. 这里我们再次细明一下存储单元和地址. 


一个地址单元是一个 byte, 一个 byte 是 8 个 bit. 我们常常用十六进制表示,那么一个 Byte 可以使用两个字符表示. 比如说 0xFF. 一个 word 表示的是 32 个 bit, 也就是 4 个 Byte. 也有 double word (简写为 dword) 表示的是两个 word, 也就是 8 个 Byte. 还有 half word, 表示的是半个 word, 那就是 2 个 bytes. 这些单位常常以后缀的方式出现在 save load 指令之中. 

For example, ~sw~ means to save a word; ~sh~ means to save a half.

** Instructions introduction
*** imm

操作名后面加上了一个 ~i~, 那么这个操作是立即数操作. 其将第二个操作数当作是立即数. 需要知道的是, 立即数会进行一个符号扩展, 扩展为一个补码表示的 number.

e.g. ~addi x1, x1, 5~

随后, 更值得注意的是, 存在 ~addi~, 但是不存在 ~subi~. this is because that we use ~addi~ to express ~subi~ 

*** TODO mul & mul

mulh 取高位指令. 详情请看 ppt 

*** TODO div

详情请看 ppt. 

*** or and and

值得注意的是, risc-v 之中并没有取非操作. 但是我们可以使用前面的知识, 进行代替, oh really?

*** shift

值得注意的是, 没有算术左移对应的指令. this is because 在一定范围内, 也就是算术左移没有发生错误的时候, 算术左移和逻辑左移是等价的. 这一点看以前的记录. 

我们复习一下, 什么时候算术位移会发生错误. 我们有这样一个判断标准: 对于左移, 如果左移之后再右移, 不能回到原本的数字的话, 那么这个左移就出错了. 于是说, 对于左移, 正数丢弃了 1, 或者是负数丢弃了 0, 就会出错.

*** save load

我们可以将寄存器之中东西塞到内存之中. 我们通过内存地址进行内存的访问. 

需要注意的是, 其他指令的操作数均是寄存器之中的数, 仅有 save load 指令能够对内存进行 access. 格式如下: 
#+begin_example
memop reg offset(bAddrReg)
#+end_example
~memop~ 指的是内存相关的操作, ~reg~ 指的是目标寄存器, 第二个操作数是 
~offset(bAddrReg)~, 一其中 ~offset~ 是一个 imm 偏移量; ~bAddrReg~ 是寄存器 which holds some address, 将寄存器里的值当作是地址. 整体的地址便是 ~offset + bAddrReg~.


#+CAPTION: 为命令指定大小
|----+---------------|
| ~sw~ | 取word        |
| ~sd~ | 取double word |
| ~sh~ | 取half word   |
| ~sb~ | 取byte        |
|----+---------------|

For load instruction ~lw ld lh lb~, they are the same.
