art/note/chapter02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-20 Tue 17:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6b2d92b">1. chapter 2</a>
<ul>
<li><a href="#org2cb87ea">1.1. ISA 是什么?</a>
<ul>
<li><a href="#org136912b">1.1.1. 原则</a></li>
<li><a href="#org09c756d">1.1.2. <span class="todo TODO">TODO</span> 汇编语言的优缺点</a></li>
</ul>
</li>
<li><a href="#orgec1161f">1.2. risc-v ISA</a>
<ul>
<li><a href="#org53ed015">1.2.1. 指令格式</a></li>
<li><a href="#org1db4147">1.2.2. 寄存器</a></li>
<li><a href="#orgd1d9d0a">1.2.3. 内存</a></li>
</ul>
</li>
<li><a href="#org42907b4">1.3. Instructions introduction</a>
<ul>
<li><a href="#org3517b1c">1.3.1. imm</a></li>
<li><a href="#org43342d8">1.3.2. <span class="todo TODO">TODO</span> mul &amp; mul</a></li>
<li><a href="#org5d3e4ce">1.3.3. <span class="todo TODO">TODO</span> div</a></li>
<li><a href="#orgf23873d">1.3.4. or and and</a></li>
<li><a href="#orgfe560ef">1.3.5. shift</a></li>
<li><a href="#orgb1c6b43">1.3.6. save load</a></li>
<li><a href="#orgbbaa899">1.3.7. sign extension</a></li>
<li><a href="#org9d8586d">1.3.8. <span class="todo TODO">TODO</span> 涉及掩码的数据传输</a></li>
<li><a href="#org0ea197f">1.3.9. add</a></li>
<li><a href="#org8da54ad">1.3.10. sub</a></li>
<li><a href="#org3d50864">1.3.11. div rem</a></li>
<li><a href="#org4b52847">1.3.12. xor</a></li>
<li><a href="#orgb565b68">1.3.13. shift</a></li>
<li><a href="#orge96712e">1.3.14. shamt</a></li>
<li><a href="#org52a1ccb">1.3.15. shift left arithmetic</a></li>
<li><a href="#org26dcefa">1.3.16. save / load</a></li>
<li><a href="#orgab01b25">1.3.17. slt</a></li>
<li><a href="#org46eec04">1.3.18. bne beq blt bltu</a></li>
<li><a href="#org97a3e38">1.3.19. jalr jal</a></li>
<li><a href="#org7c926f1">1.3.20. pseudo instruction</a></li>
</ul>
</li>
<li><a href="#orgd963c7b">1.4. How to write a function using assembly</a>
<ul>
<li><a href="#orgc1f1d88">1.4.1. How to write a loop</a></li>
<li><a href="#orgf535685">1.4.2. the concept of basic</a></li>
<li><a href="#org7ea47fd">1.4.3. Function and stack</a></li>
</ul>
</li>
<li><a href="#orgbf2fc06">1.5. The expression of an instruction</a>
<ul>
<li><a href="#org8a3cf34">1.5.1. the field of an instruction code</a></li>
<li><a href="#org338b144">1.5.2. the type of the instruction code</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org6b2d92b" class="outline-2">
<h2 id="org6b2d92b"><span class="section-number-2">1</span> chapter 2</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2cb87ea" class="outline-3">
<h3 id="org2cb87ea"><span class="section-number-3">1.1</span> ISA 是什么?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
risc-v 是一种指令集架构: ISA (instruction set architecture). 也称为处理器架构
</p>

<p>
使用同一个指令集架构的计算机就是这种 ISA 的系列机, 比如说 risc-v 系列机, Arm 系列机.  
</p>

<p>
一个 ISA 有很多参数, 最基本的参数就是通用寄存器的位宽, 一般有32bit和64 bit之分. 位宽, 指定了通用寄存器的宽度. 其决定了决定了寻址范围的大小, 数据运算能力的强弱. 地址长度为寄存器的长度, 64 bit 的地址范围当然是比 32 bit 的要长的多. 
</p>

<p>
其需要和指令编码长度分开, 指令的编码长度是越小越好的. 因为这样效率更高.
</p>
</div>

<div id="outline-container-org136912b" class="outline-4">
<h4 id="org136912b"><span class="section-number-4">1.1.1</span> 原则</h4>
<div class="outline-text-4" id="text-1-1-1">
<ol class="org-ol">
<li>简单性来自于规则性</li>
<li>越小越快</li>
<li>加速经常性时间.  经常使用的指令尽量短.</li>
<li>需要良好的折衷.</li>
</ol>
</div>
</div>


<div id="outline-container-org09c756d" class="outline-4">
<h4 id="org09c756d"><span class="section-number-4">1.1.2</span> <span class="todo TODO">TODO</span> 汇编语言的优缺点</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
废话吧这是
</p>
</div>
</div>
</div>

<div id="outline-container-orgec1161f" class="outline-3">
<h3 id="orgec1161f"><span class="section-number-3">1.2</span> risc-v ISA</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org53ed015" class="outline-4">
<h4 id="org53ed015"><span class="section-number-4">1.2.1</span> 指令格式</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
For example, 汇编指令的格式为 
</p>

<pre class="example">
op dst src1 src2
</pre>

<p>
这是最一般的指令格式, 其中有 dst(destination), 两个来源 src. 一个指令
对应一个操作. 一行最多一条指令. C语言之中的操作会被分解为一条或者是多
条指令. 来源可以是 imm 也可以是寄存器的值. 
</p>

<p>
And for example, we have 
</p>
<pre class="example">
add x1 x2 x3
</pre>
<p>
that is to say we add the values of <code>x2</code> and <code>x3</code>, and the sum goes to <code>x1</code>
</p>
</div>
</div>

<div id="outline-container-org1db4147" class="outline-4">
<h4 id="org1db4147"><span class="section-number-4">1.2.2</span> 寄存器</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
32个通用寄存器, <code>x0--x31</code>. 注意这里仅仅涉及 RV32I 或者是 RV64I 的寄存器, 这两个是 risc-v 指令的子集, 其他子集会用到其他的寄存器. 这算 dark side. For float point manipulation, we employ some processor that does the job, that is there is chip that is for float point manipulation, and there are corresponding register and instructions.
</p>

<p>
算术逻辑运算所操作的数据必须直接来自于寄存器<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. 涉及内存的操作只有 load 指令和 save 指令. 其中 <code>x0</code> 是一个特殊的寄存器, 其值恒为 0. RV32I 指令集通用寄存器的长度为 32 位, 而RV64I指令集对应的长度是 64 位
</p>

<p>
汇编是相对原始的<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>, 汇编语言之中没有变量的概念. 直接使用寄存器操作. 直接
使用寄存器能够最大化速度. 缺点在于寄存器的数量非常有限, 需要好好规划. 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">寄存器</th>
<th scope="col" class="org-left">符号</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>x0</code></td>
<td class="org-left">zero</td>
<td class="org-left">值为0</td>
</tr>

<tr>
<td class="org-left"><code>x1</code></td>
<td class="org-left">ra</td>
<td class="org-left">return address</td>
</tr>

<tr>
<td class="org-left"><code>x2</code></td>
<td class="org-left">sp</td>
<td class="org-left">stack pointer</td>
</tr>

<tr>
<td class="org-left"><code>x3</code></td>
<td class="org-left">gp</td>
<td class="org-left">global pointer</td>
</tr>

<tr>
<td class="org-left"><code>x4</code></td>
<td class="org-left">tp</td>
<td class="org-left">thread pointer</td>
</tr>

<tr>
<td class="org-left"><code>x5-x7</code></td>
<td class="org-left">t0-t2</td>
<td class="org-left">temporary register</td>
</tr>

<tr>
<td class="org-left"><code>x8</code></td>
<td class="org-left">s0/fp</td>
<td class="org-left">save register/frame pointer</td>
</tr>

<tr>
<td class="org-left"><code>x9</code></td>
<td class="org-left">s1</td>
<td class="org-left">save register</td>
</tr>

<tr>
<td class="org-left"><code>x10-x11</code></td>
<td class="org-left">a0-a1</td>
<td class="org-left">return value</td>
</tr>

<tr>
<td class="org-left"><code>x12-x17</code></td>
<td class="org-left">a2-a7</td>
<td class="org-left">function argument</td>
</tr>

<tr>
<td class="org-left"><code>x18-x27</code></td>
<td class="org-left">s2-s11</td>
<td class="org-left">save register</td>
</tr>

<tr>
<td class="org-left"><code>x28-x31</code></td>
<td class="org-left">t3-t6</td>
<td class="org-left">temporary register</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd1d9d0a" class="outline-4">
<h4 id="orgd1d9d0a"><span class="section-number-4">1.2.3</span> 内存</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Save Load instructions 实现寄存器和内存之间的读写. 这里我们再次细明一下存储单元和地址. 
</p>


<p>
一个地址单元是一个 byte, 一个 byte 是 8 个 bit. 我们常常用十六进制表示,那么一个 Byte 可以使用两个字符表示. 比如说 0xFF. 一个 word 表示的是 32 个 bit, 也就是 4 个 Byte. 也有 double word (简写为 dword) 表示的是两个 word, 也就是 8 个 Byte. 还有 half word, 表示的是半个 word, 那就是 2 个 bytes. 这些单位常常以后缀的方式出现在 save load 指令之中. 
</p>

<p>
For example, <code>sw</code> means to save a word; <code>sh</code> means to save a half.
</p>
</div>
</div>
</div>

<div id="outline-container-org42907b4" class="outline-3">
<h3 id="org42907b4"><span class="section-number-3">1.3</span> Instructions introduction</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org3517b1c" class="outline-4">
<h4 id="org3517b1c"><span class="section-number-4">1.3.1</span> imm</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
操作名后面加上了一个 <code>i</code>, 那么这个操作是立即数操作. 其将第二个操作数当作是立即数. 需要知道的是, 立即数会进行一个符号扩展, 扩展为一个补码表示的 number.
</p>

<p>
e.g. <code>addi x1, x1, 5</code>
</p>

<p>
随后, 更值得注意的是, 存在 <code>addi</code>, 但是不存在 <code>subi</code>. this is because that we use <code>addi</code> to express <code>subi</code> 
</p>
</div>
</div>

<div id="outline-container-org43342d8" class="outline-4">
<h4 id="org43342d8"><span class="section-number-4">1.3.2</span> <span class="todo TODO">TODO</span> mul &amp; mul</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
mulh 取高位指令. 详情请看 ppt 
</p>
</div>
</div>

<div id="outline-container-org5d3e4ce" class="outline-4">
<h4 id="org5d3e4ce"><span class="section-number-4">1.3.3</span> <span class="todo TODO">TODO</span> div</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
详情请看 ppt. 
</p>
</div>
</div>

<div id="outline-container-orgf23873d" class="outline-4">
<h4 id="orgf23873d"><span class="section-number-4">1.3.4</span> or and and</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
值得注意的是, risc-v 之中并没有取非操作. 但是我们可以使用前面的知识, 进行代替, oh really?
</p>
</div>
</div>

<div id="outline-container-orgfe560ef" class="outline-4">
<h4 id="orgfe560ef"><span class="section-number-4">1.3.5</span> shift</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
值得注意的是, 没有算术左移对应的指令. this is because 在一定范围内, 也就是算术左移没有发生错误的时候, 算术左移和逻辑左移是等价的. 这一点看以前的记录. 
</p>

<p>
我们复习一下, 什么时候算术位移会发生错误. 我们有这样一个判断标准: 对于左移, 如果左移之后再右移, 不能回到原本的数字的话, 那么这个左移就出错了. 于是说, 对于左移, 正数丢弃了 1, 或者是负数丢弃了 0, 就会出错.
</p>
</div>
</div>

<div id="outline-container-orgb1c6b43" class="outline-4">
<h4 id="orgb1c6b43"><span class="section-number-4">1.3.6</span> save load</h4>
<div class="outline-text-4" id="text-1-3-6">
<p>
我们可以将寄存器之中东西塞到内存之中. 我们通过内存地址进行内存的访问. 
</p>

<p>
需要注意的是, 其他指令的操作数均是寄存器之中的数, 仅有 save load 指令能够对内存进行 access. 格式如下: 
</p>
<pre class="example">
memop reg offset(bAddrReg)
</pre>
<p>
<code>memop</code> 指的是内存相关的操作, <code>reg</code> 指的是目标寄存器, 第二个操作数是 
<code>offset(bAddrReg)</code>, 一其中 <code>offset</code> 是一个 imm 偏移量; <code>bAddrReg</code> 是寄存器 which holds some address, 将寄存器里的值当作是地址. 整体的地址便是 <code>offset + bAddrReg</code>.
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> 为命令指定大小</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>sw</code></td>
<td class="org-left">取word</td>
</tr>

<tr>
<td class="org-left"><code>sd</code></td>
<td class="org-left">取double word</td>
</tr>

<tr>
<td class="org-left"><code>sh</code></td>
<td class="org-left">取half word</td>
</tr>

<tr>
<td class="org-left"><code>sb</code></td>
<td class="org-left">取byte</td>
</tr>
</tbody>
</table>

<p>
For load instruction <code>lw ld lh lb</code>, they are the same.
</p>
</div>
</div>
