art/note/chapter02.org
*** sign extension

我们进行 ~load~ 命令的时候, 要指定大小. 我们要将一个长度为 32/64/16/8 的数据, 送到 32 或者是 64 位的寄存器里面. 这个时候, 计算机会对传输的数据进行 *符号扩展*. 将这一小串数据, 看作是补码, 扩展为 32 或者64位的补码. 

比如说一个传入了一个字节 ~0x80~, 写为二进制为 ~10000000~. 也就是有符号位 1, 是一个负数, 于是扩展为 32 位的补码的时候就变为 ~0xFF80~. The procedure here is simple, if the highest bit is 1, then we fill in the 1's. If the highest bit is 0, then we fill in the 0's.

默认读写数据的时候, 会将数据扩展, 看作是有符号的 若是需要写入无符号数的话, 需要加上 ~u~. 

e.g. 传输数据的举例. 见 ppt 实际上不是很难. 

*** TODO 涉及掩码的数据传输

holy shit this part is empty.

Logical operations can do thing likes 掩码. To achieve this we can use ~and~ and ~0xFFFFFFFF~. Let us assume that the length of register is 32. A number ~and 0xFFFFFFFF~ is the number itself. But when ~and 0x0FFFFFFF~ , the number loose it first four bits.

*** add 

add 指令的表示为 
#+begin_example
add rd, rst1, rst2
#+end_example

~rd~ is register of destination. The command tell computer to do the computation---~rd = rst1 + rst2~. Note that rst1 rst2 are treated as signed numbers. Additionally, ~addi~ tells computer to do ~rd = rst1 + imm~, where ~rst2~ is replaced by an immediate number.

*** sub

#+begin_example
sub, rd, rst1, rst2
#+end_example
is the form of the instruction, telling that ~rd = rst1 - rst2~.

It is worth noting that there is no such thing as ~subi~, cause ~addi~ can do the same thing.

*** div rem 

What the fuck this place is empty.

Forget about it my friend. 

I don't have time for this.

*** xor 

Fuck it!

*** shift 
#+begin_example
op = s + l/r + a/l + [i]
#+end_example
is the decompostion of an instruction,
where ~s~ is for shift, ~l/r~ is for left or right, ~a/l~ is for arithmetic or logical, ~[]~ means that ~i~ is optional, ~i~ is for imm.

About the arithmetic shift, you check 01.pdf out.

*** shamt 

Indeed, for a 64-bits data store in a register. It would be of no use to shift of 64-bits, which resulting that in ~slai~ or other shifting command ending with ~i~, only the lowest 6-bits of immediate number are useful. Other bits are abandoned. The remaining part is called ~shamt~.

*** shift left arithmetic

There is not such thing as ~sla[i]~. We already know when the shift cause ailment. Exactly when the number is starting with \texttt{10} or \texttt{01} the result of ~sla~ is not what we want. 

However, you may check that when there is no ailment, \texttt{sla} works just like \texttt{sll}. So \texttt{sla} become less needed. 

*** save / load
#+begin_example
s/l r offset(bAddrReg)
#+end_example
where bAddrReg is a register. The command tells computer to load data from address offset + AddR to r, or to save the data in ~r~ to address ~offset + AddR~.

*Address and Word and Byte* \subsubsectio
A word in risc-v has 32 bits. There arouses an interesting question: how to load 32-bit data to a 64-bit register? 

No, what I am saying is that you need to care for whether the data is unsigned type or not. You need to expand a number when it is treated as a negative number. 

*** slt
~slt~ for set less than. ~slt~ is an instruction to compare the value of some data. 

#+begin_example
slt rd, rst1, rst2
#+end_example
means that ~rd = whether rst1 < rst2~

*** bne beq blt bltu

|----+------------------|
| b  | break            |
| eq | equal            |
| ne | not equal        |
| lt | less than        |
| ge | greater or equal |
|----+------------------|

Use this set of command to jump which is used to achieve if-else structure. Note that for ~blt, bge~, there exists unsigned type of commands.  You just add ~u~.

*** jalr jal 
#+begin_example
jal rd offset
#+end_example
称为无条件跳转. PC+4 存贮在 rd 之中. 并且 PC 赋值为 Label.

~Label~ 是一个写在程序行首的标签, 比如说 ~Exit~ 或者 ~Loop~ 等. 程序运行的时候此标签会翻译为一个指令的地址. Remember to add a colon to the label.

The actual operation it takes is ~PC = PC + \texttt{offSet}~, where ~offSet~ is translated from ~Label~.

#+begin_example
jalr rd offset(AddrReg)
#+end_example
是 ~jalr~ 的格式. 其表示, rd = PC + 4. 将 PC 的值赋为 offset + AddrReg.

*** pseudo instruction 

伪指令有简单理解的, 比如说 ~mv, sw, lw~ (sw, lw 不是伪指令, 但其能作为伪指令). 

也有比较难搞的, 比如说 ~la li~ 伪指令. 意思是将 Label 所在的指令的地址传输到 rd 上. 其中 Label 表示的是当前 PC 的值和目标指令的差值, 记为 delta, 长度为 32 位. 

** How to write a function using assembly

*** How to write a loop

我们需要分支跳转的指令来实现这点, 比如说, 我们要实现一个简单的语句: 

#+BEGIN_SRC c
for (int i = 0 ; i < 2 ; i++) {
    ans = ans + i;
}                 
#+END_SRC

分析一下就是

    1. 写下一个 Label
    2. ans = ans + i;
    3. i++
    4. 分支跳转的判断

#+BEGIN_SRC 
    add t0, x0, x0
    add t1, x0, x0
    li  t2, 2
Loop:
    add t1, t1, t0
    addi t0, t0, 1
    bne t0, t2, Loop
#+END_SRC

大概这样, t0 是 i; t1 是 ans; t2 是 2. 当然啦, bne 换为 bge 或许更好. Anyway, 上面就是一个简单的 Loop. 

*** the concept of basic

一段经常性执行的代码便是一个 basic block. 由于加速经常性时间的构想, 这段代码实际上会被特地的优化, 使得其运行速度变得更快. 

*** Function and stack

我们有的时候要将数据存入 stack, 而 stack 是位于内存里面的. 我们在手动进行汇编程序的编写的时候, 要初始化数据, 这个时候我们可以手动地为这些数据分配空间, 放在 stack 里面. 我们接下来给出一个 bing 的例子:

#+BEGIN_SRC 
factorial:
    addi sp, sp, -16  # Allocate space on stack
    sw ra, 12(sp)     # Save return address
    sw a0, 8(sp)      # Save argument n
    addi a1, x0, 1    # Initialize result to 1
    beq a0, x0, end   # If n == 0, jump to end
loop:
    mul a1, a1, a0    # result *= n
    addi a0, a0, -1   # n--
    bne a0, x0, loop  # If n != 0, jump to loop
end:
    mv a0, a1         # Return result in a0
    lw ra, 12(sp)     # Restore return address
    addi sp, sp, 16   # Deallocate space on stack
    ret               # Return from function
#+END_SRC

** The expression of an instruction

