art/note/chapter02.html
<div id="outline-container-orgbbaa899" class="outline-4">
<h4 id="orgbbaa899"><span class="section-number-4">1.3.7</span> sign extension</h4>
<div class="outline-text-4" id="text-1-3-7">
<p>
我们进行 <code>load</code> 命令的时候, 要指定大小. 我们要将一个长度为 32/64/16/8 的数据, 送到 32 或者是 64 位的寄存器里面. 这个时候, 计算机会对传输的数据进行 <b>符号扩展</b>. 将这一小串数据, 看作是补码, 扩展为 32 或者64位的补码. 
</p>

<p>
比如说一个传入了一个字节 <code>0x80</code>, 写为二进制为 <code>10000000</code>. 也就是有符号位 1, 是一个负数, 于是扩展为 32 位的补码的时候就变为 <code>0xFF80</code>. The procedure here is simple, if the highest bit is 1, then we fill in the 1's. If the highest bit is 0, then we fill in the 0's.
</p>

<p>
默认读写数据的时候, 会将数据扩展, 看作是有符号的 若是需要写入无符号数的话, 需要加上 <code>u</code>. 
</p>

<p>
e.g. 传输数据的举例. 见 ppt 实际上不是很难. 
</p>
</div>
</div>

<div id="outline-container-org9d8586d" class="outline-4">
<h4 id="org9d8586d"><span class="section-number-4">1.3.8</span> <span class="todo TODO">TODO</span> 涉及掩码的数据传输</h4>
<div class="outline-text-4" id="text-1-3-8">
<p>
holy shit this part is empty.
</p>

<p>
Logical operations can do thing likes 掩码. To achieve this we can use <code>and</code> and <code>0xFFFFFFFF</code>. Let us assume that the length of register is 32. A number <code>and 0xFFFFFFFF</code> is the number itself. But when <code>and 0x0FFFFFFF</code> , the number loose it first four bits.
</p>
</div>
</div>

<div id="outline-container-org0ea197f" class="outline-4">
<h4 id="org0ea197f"><span class="section-number-4">1.3.9</span> add</h4>
<div class="outline-text-4" id="text-1-3-9">
<p>
add 指令的表示为 
</p>
<pre class="example">
add rd, rst1, rst2
</pre>

<p>
<code>rd</code> is register of destination. The command tell computer to do the computation---<code>rd = rst1 + rst2</code>. Note that rst1 rst2 are treated as signed numbers. Additionally, <code>addi</code> tells computer to do <code>rd = rst1 + imm</code>, where <code>rst2</code> is replaced by an immediate number.
</p>
</div>
</div>

<div id="outline-container-org8da54ad" class="outline-4">
<h4 id="org8da54ad"><span class="section-number-4">1.3.10</span> sub</h4>
<div class="outline-text-4" id="text-1-3-10">
<pre class="example">
sub, rd, rst1, rst2
</pre>
<p>
is the form of the instruction, telling that <code>rd = rst1 - rst2</code>.
</p>

<p>
It is worth noting that there is no such thing as <code>subi</code>, cause <code>addi</code> can do the same thing.
</p>
</div>
</div>

<div id="outline-container-org3d50864" class="outline-4">
<h4 id="org3d50864"><span class="section-number-4">1.3.11</span> div rem</h4>
<div class="outline-text-4" id="text-1-3-11">
<p>
What the fuck this place is empty.
</p>

<p>
Forget about it my friend. 
</p>

<p>
I don't have time for this.
</p>
</div>
</div>

<div id="outline-container-org4b52847" class="outline-4">
<h4 id="org4b52847"><span class="section-number-4">1.3.12</span> xor</h4>
<div class="outline-text-4" id="text-1-3-12">
<p>
Fuck it!
</p>
</div>
</div>

<div id="outline-container-orgb565b68" class="outline-4">
<h4 id="orgb565b68"><span class="section-number-4">1.3.13</span> shift</h4>
<div class="outline-text-4" id="text-1-3-13">
<pre class="example">
op = s + l/r + a/l + [i]
</pre>
<p>
is the decompostion of an instruction,
where <code>s</code> is for shift, <code>l/r</code> is for left or right, <code>a/l</code> is for arithmetic or logical, <code>[]</code> means that <code>i</code> is optional, <code>i</code> is for imm.
</p>

<p>
About the arithmetic shift, you check 01.pdf out.
</p>
</div>
</div>

<div id="outline-container-orge96712e" class="outline-4">
<h4 id="orge96712e"><span class="section-number-4">1.3.14</span> shamt</h4>
<div class="outline-text-4" id="text-1-3-14">
<p>
Indeed, for a 64-bits data store in a register. It would be of no use to shift of 64-bits, which resulting that in <code>slai</code> or other shifting command ending with <code>i</code>, only the lowest 6-bits of immediate number are useful. Other bits are abandoned. The remaining part is called <code>shamt</code>.
</p>
</div>
</div>

<div id="outline-container-org52a1ccb" class="outline-4">
<h4 id="org52a1ccb"><span class="section-number-4">1.3.15</span> shift left arithmetic</h4>
<div class="outline-text-4" id="text-1-3-15">
<p>
There is not such thing as <code>sla[i]</code>. We already know when the shift cause ailment. Exactly when the number is starting with \texttt{10} or \texttt{01} the result of <code>sla</code> is not what we want. 
</p>

<p>
However, you may check that when there is no ailment, \texttt{sla} works just like \texttt{sll}. So \texttt{sla} become less needed. 
</p>
</div>
</div>

<div id="outline-container-org26dcefa" class="outline-4">
<h4 id="org26dcefa"><span class="section-number-4">1.3.16</span> save / load</h4>
<div class="outline-text-4" id="text-1-3-16">
<pre class="example">
s/l r offset(bAddrReg)
</pre>
<p>
where bAddrReg is a register. The command tells computer to load data from address offset + AddR to r, or to save the data in <code>r</code> to address <code>offset + AddR</code>.
</p>

<p>
<b>Address and Word and Byte</b> \subsubsectio
A word in risc-v has 32 bits. There arouses an interesting question: how to load 32-bit data to a 64-bit register? 
</p>

<p>
No, what I am saying is that you need to care for whether the data is unsigned type or not. You need to expand a number when it is treated as a negative number. 
</p>
</div>
</div>

<div id="outline-container-orgab01b25" class="outline-4">
<h4 id="orgab01b25"><span class="section-number-4">1.3.17</span> slt</h4>
<div class="outline-text-4" id="text-1-3-17">
<p>
<code>slt</code> for set less than. <code>slt</code> is an instruction to compare the value of some data. 
</p>

<pre class="example">
slt rd, rst1, rst2
</pre>
<p>
means that <code>rd = whether rst1 &lt; rst2</code>
</p>
</div>
</div>

<div id="outline-container-org46eec04" class="outline-4">
<h4 id="org46eec04"><span class="section-number-4">1.3.18</span> bne beq blt bltu</h4>
<div class="outline-text-4" id="text-1-3-18">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">b</td>
<td class="org-left">break</td>
</tr>

<tr>
<td class="org-left">eq</td>
<td class="org-left">equal</td>
</tr>

<tr>
<td class="org-left">ne</td>
<td class="org-left">not equal</td>
</tr>

<tr>
<td class="org-left">lt</td>
<td class="org-left">less than</td>
</tr>

<tr>
<td class="org-left">ge</td>
<td class="org-left">greater or equal</td>
</tr>
</tbody>
</table>


<p>
Use this set of command to jump which is used to achieve if-else structure. Note that for <code>blt, bge</code>, there exists unsigned type of commands.  You just add <code>u</code>.
</p>
</div>
</div>

<div id="outline-container-org97a3e38" class="outline-4">
<h4 id="org97a3e38"><span class="section-number-4">1.3.19</span> jalr jal</h4>
<div class="outline-text-4" id="text-1-3-19">
<pre class="example">
jal rd offset
</pre>
<p>
称为无条件跳转. PC+4 存贮在 rd 之中. 并且 PC 赋值为 Label.
</p>

<p>
<code>Label</code> 是一个写在程序行首的标签, 比如说 <code>Exit</code> 或者 <code>Loop</code> 等. 程序运行的时候此标签会翻译为一个指令的地址. Remember to add a colon to the label.
</p>

<p>
The actual operation it takes is <code>PC = PC + \texttt{offSet}</code>, where <code>offSet</code> is translated from <code>Label</code>.
</p>

<pre class="example">
jalr rd offset(AddrReg)
</pre>
<p>
是 <code>jalr</code> 的格式. 其表示, rd = PC + 4. 将 PC 的值赋为 offset + AddrReg.
</p>
</div>
</div>

<div id="outline-container-org7c926f1" class="outline-4">
<h4 id="org7c926f1"><span class="section-number-4">1.3.20</span> pseudo instruction</h4>
<div class="outline-text-4" id="text-1-3-20">
<p>
伪指令有简单理解的, 比如说 <code>mv, sw, lw</code> (sw, lw 不是伪指令, 但其能作为伪指令). 
</p>

<p>
也有比较难搞的, 比如说 <code>la li</code> 伪指令. 意思是将 Label 所在的指令的地址传输到 rd 上. 其中 Label 表示的是当前 PC 的值和目标指令的差值, 记为 delta, 长度为 32 位. 
</p>
</div>
</div>
</div>

<div id="outline-container-orgd963c7b" class="outline-3">
<h3 id="orgd963c7b"><span class="section-number-3">1.4</span> How to write a function using assembly</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orgc1f1d88" class="outline-4">
<h4 id="orgc1f1d88"><span class="section-number-4">1.4.1</span> How to write a loop</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
我们需要分支跳转的指令来实现这点, 比如说, 我们要实现一个简单的语句: 
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #859900;">for</span> (<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">i</span> = 0 ; i &lt; 2 ; i++) {
    ans = ans + i;
}                 
</pre>
</div>

<p>
分析一下就是
</p>
<ol class="org-ol">
<li>写下一个 Label</li>
<li>ans = ans + i;</li>
<li>i++</li>
<li>分支跳转的判断</li>
</ol>

<pre class="example">
    add t0, x0, x0
    add t1, x0, x0
    li  t2, 2
Loop:
    add t1, t1, t0
    addi t0, t0, 1
    bne t0, t2, Loop
</pre>

<p>
大概这样, t0 是 i; t1 是 ans; t2 是 2. 当然啦, bne 换为 bge 或许更好. Anyway, 上面就是一个简单的 Loop. 
</p>
</div>
</div>

<div id="outline-container-orgf535685" class="outline-4">
<h4 id="orgf535685"><span class="section-number-4">1.4.2</span> the concept of basic</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
一段经常性执行的代码便是一个 basic block. 由于加速经常性时间的构想, 这段代码实际上会被特地的优化, 使得其运行速度变得更快. 
</p>
</div>
</div>

<div id="outline-container-org7ea47fd" class="outline-4">
<h4 id="org7ea47fd"><span class="section-number-4">1.4.3</span> Function and stack</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
我们有的时候要将数据存入 stack, 而 stack 是位于内存里面的. 我们在手动进行汇编程序的编写的时候, 要初始化数据, 这个时候我们可以手动地为这些数据分配空间, 放在 stack 里面. 我们接下来给出一个 bing 的例子:
</p>

<pre class="example">
factorial:
    addi sp, sp, -16  # Allocate space on stack
    sw ra, 12(sp)     # Save return address
    sw a0, 8(sp)      # Save argument n
    addi a1, x0, 1    # Initialize result to 1
    beq a0, x0, end   # If n == 0, jump to end
loop:
    mul a1, a1, a0    # result *= n
    addi a0, a0, -1   # n--
    bne a0, x0, loop  # If n != 0, jump to loop
end:
    mv a0, a1         # Return result in a0
    lw ra, 12(sp)     # Restore return address
    addi sp, sp, 16   # Deallocate space on stack
    ret               # Return from function
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf2fc06" class="outline-3">
<h3 id="orgbf2fc06"><span class="section-number-3">1.5</span> The expression of an instruction</h3>
<div class="outline-text-3" id="text-1-5">
</div>
